#向量与赋值
X<-c(1,3,5,6);X
assign("X",c(1,3,5,6));X
X=c(1,3,5,6);X

#向量的运算
X<-c(-1,0,2);
Y<-c(3,8,2);
V<-2*X+Y+1;
V

#(%/%)代表整数而（%%）则代表余数
5%/%2
5%%2

#基本运算
X<-c(-1,0,2);
Y<-c(3,8,2);
X*Y        #对应坐标相乘(返回向量)
X%*%Y      #向量的点积(返回值)
exp(X)     #指数运算
sqrt(Y)    #开平方根

#向量相关的函数

#最值
X<-c(10,2,6,8,3,4,-2,1,0,5);
min(X)  #求最大值
max(X)  #求最小值

#求和，求积函数
X<-c(10,2,6,8,3,4,-2,1,0,5);
sum(X)      #求和函数
cumsum(X)   #返回累计和
prod(X)     #求积函数
cumprod(X)  #返回累计积

#向量个数与逆序
X<-c(10,2,6,8,3,4,-2,1,0,5);
length(X)   #求向量的长度
rev(X)      #求向量的逆序

#向量的中位数，均值，方差，标准差和次序统计量
X<-c(10,2,6,8,3,4,-2,1,0,5);
median(X)   #求向量的中位数
mean(X)     #求向量的均值
var(X)      #求向量的方差
sd(X)       #求向量的标准差
sort(X,decreasing = TRUE)     #对向量排序,decreasing = TRUE表示倒序，去掉表示升序
order(X,decreasing = TRUE)    #返回向量排序后的下标,decreasing = TRUE表示倒序，去掉表示升序

#产生有规律的序列
X<-1:30        #a:b等差为1，逐项加1，只对a，无论b是整数还是实数，运算优于四则
seq(-5,5,by=0.2)              #产生更一般的数列
seq(length=5,from=-1,by=2)    #生成长度为5，从1开始，公差为2的等差数列
rep(X,3)       #对向量重复3次
rep(X,each=3)  #对向量中的每个元素重复3次

#逻辑向量
z<-c(FALSE,TRUE,F,T)       #FALSE与TRUE为逻辑向量
all(c(1,2,3,4,5,6,7)>5)    #判断向量中所有的元素是否都大于5
any(c(1,2,3,4,5,6,7)>5)    #判断向量中是否有大于5的元素

#缺失数据
X<-c(1,2,NA,NaN,Inf);
is.na(X)                   #用于检验数据中是否有缺失数据NA
is.nan(X)                  #用于检验数据中是否有不确定数据NAN
is.finite(X)               #用于检验数据中是否有限无限为Inf

#字符串向量
y<-c("er","sdf","eir","jk")      #直接赋值法
paste("Today","is","Monday")     #用于连接字符串，中间用空格隔开

#复数向量
x<-seq(-pi,pi,by=pi/10);
y<-sin(x);
z<-complex(re=x,im=y)    #生成复数向量re为实部，im为虚部
plot(z)                  #在图中画出向量中的点
lines(z)                 #在图中将向量中的点连成线

#向量的下标运算
X<-c(6,3,2,4);
X[2]                #直接输入下标
(c(6,3,2)+2)[3]     #对整体作用
X[2]<-23            #改变特定的位置的值
X[c(1,3)]<-c(12,45)
X[X>3]              #返回那个符合条件的向量中的元素下标

#定义分段函数
y<-numeric(length(x));   #生成数据值向量
y[x<0]<- -1-x[x<0];
y[x>=0]<- -1+x[x>=0];
plot(y)
lines(y)

#给向量元素加名称
ages<-c(Zhang=33,Wang=12,Li=15);  #先加
ages
fruit<-c(5,10,1,20);
names(fruit)<-c("orange","banana","aplle","peach");
fruit
